{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+aQAAAHMAAAAA\n", null, null], "trainable": true, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "dtype": "float32", "name": "lambda_1", "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"filters": 24, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "strides": [2, 2], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 36, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "strides": [2, 2], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 48, "data_format": "channels_last", "trainable": true, "kernel_size": [5, 5], "strides": [2, 2], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"filters": 64, "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_5", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "units": 100, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "units": 50, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "units": 10, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}