{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Lambda", "config": {"dtype": "float32", "output_shape": null, "arguments": {}, "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+WgAAAHMAAAAA\n", null, null], "output_shape_type": "raw"}}, {"class_name": "Cropping2D", "config": {"data_format": "channels_last", "cropping": [[70, 25], [0, 0]], "trainable": true, "name": "cropping2d_1"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 24, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 36, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_size": [5, 5], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 48, "strides": [2, 2], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.75}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_2", "bias_constraint": null, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_3", "bias_constraint": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_4", "bias_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}