{"keras_version": "2.1.5", "config": [{"config": {"trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+bQAAAHMAAAAA\n", null, null], "arguments": {}, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 24, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_size": [5, 5], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 36, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_size": [5, 5], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 48, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_size": [5, 5], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_5", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "relu", "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.75}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "name": "dense_1", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 50, "name": "dense_2", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "name": "dense_3", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "name": "dense_4", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}