{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+WQAAAHMAAAAA\n", null, null], "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "batch_input_shape": [null, 160, 320, 3], "dtype": "float32"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "filters": 24, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "filters": 36, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "filters": 48, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "filters": 64, "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "filters": 64, "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.75, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}], "backend": "tensorflow"}